; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-3-5-11)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	package11 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	p0-2 - location
	p0-3 - location
	p1-6 - location
	p2-1 - location
	p2-4 - location
	p3-5 - location
	p3-8 - location
	p4-0 - location
	p6-0 - location
	p6-2 - location
	p6-8 - location
	p7-0 - location
	p7-5 - location
	p8-4 - location
	p8-5 - location
	)
	(:init
	(at driver1 s5)
	(at driver2 s4)
	(at driver3 s4)
	(at truck1 s7)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s8)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s5)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s2)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at truck5 s2)
	(empty truck5)
	(= (load truck5) 0)
	(= (fuel-per-minute truck5) 10)
	(at package1 s5)
	(at package2 s7)
	(at package3 s5)
	(at package4 s5)
	(at package5 s5)
	(at package6 s5)
	(at package7 s2)
	(at package8 s8)
	(at package9 s5)
	(at package10 s3)
	(at package11 s3)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(path s1 p1-6)
	(path p1-6 s1)
	(path s6 p1-6)
	(path p1-6 s6)
	(path s2 p2-1)
	(path p2-1 s2)
	(path s1 p2-1)
	(path p2-1 s1)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(path s3 p3-5)
	(path p3-5 s3)
	(path s5 p3-5)
	(path p3-5 s5)
	(path s3 p3-8)
	(path p3-8 s3)
	(path s8 p3-8)
	(path p3-8 s8)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(path s6 p6-0)
	(path p6-0 s6)
	(path s0 p6-0)
	(path p6-0 s0)
	(path s6 p6-2)
	(path p6-2 s6)
	(path s2 p6-2)
	(path p6-2 s2)
	(path s6 p6-8)
	(path p6-8 s6)
	(path s8 p6-8)
	(path p6-8 s8)
	(path s7 p7-0)
	(path p7-0 s7)
	(path s0 p7-0)
	(path p7-0 s0)
	(path s7 p7-5)
	(path p7-5 s7)
	(path s5 p7-5)
	(path p7-5 s5)
	(path s8 p8-4)
	(path p8-4 s8)
	(path s4 p8-4)
	(path p8-4 s4)
	(path s8 p8-5)
	(path p8-5 s8)
	(path s5 p8-5)
	(path p8-5 s5)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 73)
	(= (time-to-drive s1 s0) 73)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 59)
	(= (time-to-drive s2 s0) 59)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 4)
	(= (time-to-drive s3 s0) 4)
	(link s0 s7)
	(link s7 s0)
	(= (time-to-drive s0 s7) 14)
	(= (time-to-drive s7 s0) 14)
	(link s0 s8)
	(link s8 s0)
	(= (time-to-drive s0 s8) 92)
	(= (time-to-drive s8 s0) 92)
	(link s1 s5)
	(link s5 s1)
	(= (time-to-drive s1 s5) 87)
	(= (time-to-drive s5 s1) 87)
	(link s1 s7)
	(link s7 s1)
	(= (time-to-drive s1 s7) 35)
	(= (time-to-drive s7 s1) 35)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 60)
	(= (time-to-drive s1 s2) 60)
	(link s2 s5)
	(link s5 s2)
	(= (time-to-drive s2 s5) 31)
	(= (time-to-drive s5 s2) 31)
	(link s3 s2)
	(link s2 s3)
	(= (time-to-drive s3 s2) 89)
	(= (time-to-drive s2 s3) 89)
	(link s3 s4)
	(link s4 s3)
	(= (time-to-drive s3 s4) 56)
	(= (time-to-drive s4 s3) 56)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 37)
	(= (time-to-drive s1 s4) 37)
	(link s4 s2)
	(link s2 s4)
	(= (time-to-drive s4 s2) 26)
	(= (time-to-drive s2 s4) 26)
	(link s4 s5)
	(link s5 s4)
	(= (time-to-drive s4 s5) 19)
	(= (time-to-drive s5 s4) 19)
	(link s4 s6)
	(link s6 s4)
	(= (time-to-drive s4 s6) 5)
	(= (time-to-drive s6 s4) 5)
	(link s4 s8)
	(link s8 s4)
	(= (time-to-drive s4 s8) 33)
	(= (time-to-drive s8 s4) 33)
	(link s5 s0)
	(link s0 s5)
	(= (time-to-drive s5 s0) 87)
	(= (time-to-drive s0 s5) 87)
	(link s5 s3)
	(link s3 s5)
	(= (time-to-drive s5 s3) 100)
	(= (time-to-drive s3 s5) 100)
	(link s6 s2)
	(link s2 s6)
	(= (time-to-drive s6 s2) 9)
	(= (time-to-drive s2 s6) 9)
	(link s6 s3)
	(link s3 s6)
	(= (time-to-drive s6 s3) 3)
	(= (time-to-drive s3 s6) 3)
	(link s6 s5)
	(link s5 s6)
	(= (time-to-drive s6 s5) 85)
	(= (time-to-drive s5 s6) 85)
	(link s7 s2)
	(link s2 s7)
	(= (time-to-drive s7 s2) 10)
	(= (time-to-drive s2 s7) 10)
	(link s7 s4)
	(link s4 s7)
	(= (time-to-drive s7 s4) 44)
	(= (time-to-drive s4 s7) 44)
	(link s8 s3)
	(link s3 s8)
	(= (time-to-drive s8 s3) 28)
	(= (time-to-drive s3 s8) 28)
	(link s8 s6)
	(link s6 s8)
	(= (time-to-drive s8 s6) 64)
	(= (time-to-drive s6 s8) 64)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver3 s3)
	(at truck1 s3)
	(at truck2 s3)
	(at truck3 s7)
	(at truck4 s2)
	(at package2 s1)
	(at package3 s7)
	(at package4 s2)
	(at package5 s7)
	(at package7 s6)
	(at package8 s2)
	(at package9 s4)
	(at package10 s7)
	(at package11 s3)
	))

(:metric minimize (+ (* 2 (total-time)) (* 1 (fuel-used))))

)

; plan
1. (board-truck driver1 truck3 s5)
   deleted: (at driver1 s5) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 2 of 14
2. (drive-truck truck3 s5 s4 driver1)
   deleted: (at truck3 s5)
   added: (at truck3 s4)
   changed: (fuel-used) from 0 to 190
   goals met: 2 of 14
3. (drive-truck truck3 s4 s7 driver1)
   deleted: (at truck3 s4)
   added: (at truck3 s7)
   changed: (fuel-used) from 190 to 630
   goals met: 3 of 14
4. (load-truck package2 truck3 s7)
   deleted: (at package2 s7)
   added: (in package2 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 3 of 14
5. (walk driver3 s4 p8-4)
   deleted: (at driver3 s4)
   added: (at driver3 p8-4)
   goals met: 3 of 14
6. (walk driver3 p8-4 s8)
   deleted: (at driver3 p8-4)
   added: (at driver3 s8)
   goals met: 3 of 14
7. (walk driver3 s8 p3-8)
   deleted: (at driver3 s8)
   added: (at driver3 p3-8)
   goals met: 3 of 14
8. (walk driver3 p3-8 s3)
   deleted: (at driver3 p3-8)
   added: (at driver3 s3)
   goals met: 4 of 14
9. (disembark-truck driver1 truck3 s7)
   deleted: (driving driver1 truck3)
   added: (at driver1 s7) (empty truck3)
   goals met: 4 of 14
10. (board-truck driver1 truck1 s7)
   deleted: (at driver1 s7) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 4 of 14
11. (unload-truck package2 truck3 s7)
   deleted: (in package2 truck3)
   added: (at package2 s7)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 4 of 14
12. (walk driver2 s4 p8-4)
   deleted: (at driver2 s4)
   added: (at driver2 p8-4)
   goals met: 4 of 14
13. (load-truck package2 truck1 s7)
   deleted: (at package2 s7)
   added: (in package2 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 4 of 14
14. (walk driver2 p8-4 s8)
   deleted: (at driver2 p8-4)
   added: (at driver2 s8)
   goals met: 4 of 14
15. (drive-truck truck1 s7 s2 driver1)
   deleted: (at truck1 s7)
   added: (at truck1 s2)
   changed: (fuel-used) from 630 to 740
   goals met: 4 of 14
16. (load-truck package7 truck1 s2)
   deleted: (at package7 s2)
   added: (in package7 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 4 of 14
17. (drive-truck truck1 s2 s3 driver1)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   changed: (fuel-used) from 740 to 1897
   goals met: 5 of 14
18. (load-truck package10 truck1 s3)
   deleted: (at package10 s3)
   added: (in package10 truck1)
   changed: (load truck1) from 2 to 3, (fuel-per-minute truck1) from 13 to 16
   goals met: 5 of 14
19. (board-truck driver2 truck2 s8)
   deleted: (at driver2 s8) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 5 of 14
20. (drive-truck truck1 s3 s2 driver1)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   changed: (fuel-used) from 1897 to 3321
   goals met: 4 of 14
21. (load-truck package8 truck2 s8)
   deleted: (at package8 s8)
   added: (in package8 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 4 of 14
22. (drive-truck truck2 s8 s3 driver2)
   deleted: (at truck2 s8)
   added: (at truck2 s3)
   changed: (fuel-used) from 3321 to 3629
   goals met: 5 of 14
23. (drive-truck truck2 s3 s2 driver2)
   deleted: (at truck2 s3)
   added: (at truck2 s2)
   changed: (fuel-used) from 3629 to 4608
   goals met: 4 of 14
24. (unload-truck package8 truck2 s2)
   deleted: (in package8 truck2)
   added: (at package8 s2)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 5 of 14
25. (drive-truck truck2 s2 s3 driver2)
   deleted: (at truck2 s2)
   added: (at truck2 s3)
   changed: (fuel-used) from 4608 to 5498
   goals met: 6 of 14
26. (drive-truck truck1 s2 s7 driver1)
   deleted: (at truck1 s2)
   added: (at truck1 s7)
   changed: (fuel-used) from 5498 to 5658
   goals met: 6 of 14
27. (unload-truck package10 truck1 s7)
   deleted: (in package10 truck1)
   added: (at package10 s7)
   changed: (load truck1) from 3 to 2, (fuel-per-minute truck1) from 16 to 13
   goals met: 7 of 14
28. (drive-truck truck1 s7 s2 driver1)
   deleted: (at truck1 s7)
   added: (at truck1 s2)
   changed: (fuel-used) from 5658 to 5788
   goals met: 7 of 14
29. (drive-truck truck1 s2 s5 driver1)
   deleted: (at truck1 s2)
   added: (at truck1 s5)
   changed: (fuel-used) from 5788 to 6191
   goals met: 7 of 14
30. (load-truck package4 truck1 s5)
   deleted: (at package4 s5)
   added: (in package4 truck1)
   changed: (load truck1) from 2 to 3, (fuel-per-minute truck1) from 13 to 16
   goals met: 7 of 14
31. (drive-truck truck1 s5 s2 driver1)
   deleted: (at truck1 s5)
   added: (at truck1 s2)
   changed: (fuel-used) from 6191 to 6687
   goals met: 7 of 14
32. (unload-truck package4 truck1 s2)
   deleted: (in package4 truck1)
   added: (at package4 s2)
   changed: (load truck1) from 3 to 2, (fuel-per-minute truck1) from 16 to 13
   goals met: 8 of 14
33. (drive-truck truck1 s2 s6 driver1)
   deleted: (at truck1 s2)
   added: (at truck1 s6)
   changed: (fuel-used) from 6687 to 6804
   goals met: 8 of 14
34. (unload-truck package7 truck1 s6)
   deleted: (in package7 truck1)
   added: (at package7 s6)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 9 of 14
35. (drive-truck truck1 s6 s4 driver1)
   deleted: (at truck1 s6)
   added: (at truck1 s4)
   changed: (fuel-used) from 6804 to 6859
   goals met: 9 of 14
36. (drive-truck truck1 s4 s1 driver1)
   deleted: (at truck1 s4)
   added: (at truck1 s1)
   changed: (fuel-used) from 6859 to 7266
   goals met: 9 of 14
37. (unload-truck package2 truck1 s1)
   deleted: (in package2 truck1)
   added: (at package2 s1)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 10 of 14
38. (drive-truck truck1 s1 s5 driver1)
   deleted: (at truck1 s1)
   added: (at truck1 s5)
   changed: (fuel-used) from 7266 to 8136
   goals met: 10 of 14
39. (load-truck package9 truck1 s5)
   deleted: (at package9 s5)
   added: (in package9 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 10 of 14
40. (load-truck package3 truck1 s5)
   deleted: (at package3 s5)
   added: (in package3 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 10 of 14
41. (load-truck package5 truck1 s5)
   deleted: (at package5 s5)
   added: (in package5 truck1)
   changed: (load truck1) from 2 to 3, (fuel-per-minute truck1) from 13 to 16
   goals met: 10 of 14
42. (drive-truck truck1 s5 s4 driver1)
   deleted: (at truck1 s5)
   added: (at truck1 s4)
   changed: (fuel-used) from 8136 to 8440
   goals met: 10 of 14
43. (unload-truck package9 truck1 s4)
   deleted: (in package9 truck1)
   added: (at package9 s4)
   changed: (load truck1) from 3 to 2, (fuel-per-minute truck1) from 16 to 13
   goals met: 11 of 14
44. (drive-truck truck1 s4 s7 driver1)
   deleted: (at truck1 s4)
   added: (at truck1 s7)
   changed: (fuel-used) from 8440 to 9012
   goals met: 11 of 14
45. (unload-truck package3 truck1 s7)
   deleted: (in package3 truck1)
   added: (at package3 s7)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 12 of 14
46. (unload-truck package5 truck1 s7)
   deleted: (in package5 truck1)
   added: (at package5 s7)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 13 of 14
47. (drive-truck truck1 s7 s0 driver1)
   deleted: (at truck1 s7)
   added: (at truck1 s0)
   changed: (fuel-used) from 9012 to 9152
   goals met: 13 of 14
48. (drive-truck truck1 s0 s3 driver1)
   deleted: (at truck1 s0)
   added: (at truck1 s3)
   changed: (fuel-used) from 9152 to 9192
   goals met: 14 of 14
